app/views/session/show.html.erb

    <th scope="col"><%= t('students.surname') %></th>
    <th scope="col"><%= t('students.group') %></th>
---
SELECT `students`.* FROM `students` WHERE `students`.`session_id` = 5

  <tbody>
  <% @session.students.each do |st| %>
---
SELECT `students`.* FROM `students` WHERE `students`.`session_id` = 9