app/controllers/session_controller.rb

  def destroy
    @session = Session.find(params[:id])
    @session.students.each do |st|
      st.destroy
    end

    @session.destroy
---
SELECT `students`.* FROM `students` WHERE `students`.`session_id` = 2
DELETE FROM `students` WHERE `students`.`id` = 2