app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1

  def create
    @session = Session.find(params[:session_id])
    @student = @session.students.create(student_params)
---
INSERT INTO `students` (`surname`, `group`, `geometryMark`, `algebraMark`, `infoMark`, `created_at`, `updated_at`, `session_id`) VALUES ('linkov', '56', 2, 3, 5, '2022-11-20 21:01:27.695309', '2022-11-20 21:01:27.695309', 1)

  def edit
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 11 LIMIT 1

  def destroy
    @session = Session.find(params[:id])
    @student = Student.find(params[:session_id])

    @student.destroy
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 1